#+TITLE: Readme

#+begin_src bash :exports both :results output
moc main.mo --package base ../motoko-base/src/ -r
#+end_src

#+RESULTS:
#+begin_example

immutable array with immutable elements
[1, 3, 5]

immutable array with mutable elements
[var "hi"]
[var "welcome"]

mutable array with immutable elements
[1, 3, 5]
[5, 5, 5]

mutable array with mutable elements
[var 1, 3, 5]
[var 5, 5, 5]
[var 5, 5, 55]

array with custom types
[var (3, "x"), (5, "a")]
[var (3, "x"), (11, "rr")]

Array.init constructor - allocate mutable array with dynamic size
[var 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]

Array.tabulate constructor - generation function
[0, 1, 16, 3, 4, 5, 6]
#+end_example
